app/controllers/events_controller.rb

  def create
    @events = Event.new events_params
    if @events.save
---
INSERT INTO "events" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Beach party"], ["content", "Palawan getaway"], ["created_at", 2017-04-26 01:58:56 UTC], ["updated_at", 2017-04-26 01:58:56 UTC]]