app/controllers/index_controller.rb

SELECT  "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT $1  [["LIMIT", 5]]
---
  def index
    @events = Event.last(5)